// Необходимо создать три потока, которые изменяют один и тот же объект. Каждый поток должен вывести на экран одну букву 100 раз, и затем увеличить значение символа на 1. 

// Создать класс расширяющий Thread. 
// Переопределить метод run() - здесь будет находиться синхронизированный блок кода. 
// Для того чтобы три объекта потока имели доступ к одному объекту, создаем конструктор принимающий на вход StringBuilder объект. 
// Синхронизированный блок кода будет получать монитор на объект StringBuilder из пункта 3. 
// Внутри синхронизированного блока кода выведите StringBuilder на экран 100 раз, а потом увеличьте значение символа на 1. 
// В методе main() создайте один объект класса StringBuilder, используя символ ‘a’.
// Затем создайте три экземпляра объекта нашего класса и запустите потоки

public class Thread3 extends Thread {

    // Значение переменной, объявленной как volatile, асинхронно меняется во всех потоках
    volatile StringBuilder sBuilder;
    Thread3 (StringBuilder sBuilder) {
        this.sBuilder = sBuilder;
    }

    @Override
    public void run() {
        // сократила кол-во выводов до 30 для наглядности
        for (int i = 1; i <= 30; i++) {
            System.out.println(Thread.currentThread().getName() + " " + sBuilder + " " + i);
        }
        sBuilder.setCharAt(0, (char)(sBuilder.charAt(0) + 1));
    }
}
